GopalSaraf/Practicals/PSDL/include/proc/pic16lf1787.inc
// Register: PSMC1BLNK
#define PSMC1BLNK PSMC1BLNK
PSMC1BLNK                                equ 0817h
// bitfield definitions
PSMC1BLNK_P1REBM_POSN                    equ 0000h
PSMC1BLNK_P1REBM_POSITION                equ 0000h
PSMC1BLNK_P1REBM_SIZE                    equ 0002h
PSMC1BLNK_P1REBM_LENGTH                  equ 0002h
PSMC1BLNK_P1REBM_MASK                    equ 0003h
PSMC1BLNK_P1FEBM_POSN                    equ 0004h
PSMC1BLNK_P1FEBM_POSITION                equ 0004h
PSMC1BLNK_P1FEBM_SIZE                    equ 0002h
PSMC1BLNK_P1FEBM_LENGTH                  equ 0002h
PSMC1BLNK_P1FEBM_MASK                    equ 0030h
PSMC1BLNK_P1REBM0_POSN                   equ 0000h
PSMC1BLNK_P1REBM0_POSITION               equ 0000h
PSMC1BLNK_P1REBM0_SIZE                   equ 0001h
PSMC1BLNK_P1REBM0_LENGTH                 equ 0001h
PSMC1BLNK_P1REBM0_MASK                   equ 0001h
PSMC1BLNK_P1REBM1_POSN                   equ 0001h
PSMC1BLNK_P1REBM1_POSITION               equ 0001h
PSMC1BLNK_P1REBM1_SIZE                   equ 0001h
PSMC1BLNK_P1REBM1_LENGTH                 equ 0001h
PSMC1BLNK_P1REBM1_MASK                   equ 0002h
PSMC1BLNK_P1FEBM0_POSN                   equ 0004h
PSMC1BLNK_P1FEBM0_POSITION               equ 0004h
PSMC1BLNK_P1FEBM0_SIZE                   equ 0001h
PSMC1BLNK_P1FEBM0_LENGTH                 equ 0001h
PSMC1BLNK_P1FEBM0_MASK                   equ 0010h
PSMC1BLNK_P1FEBM1_POSN                   equ 0005h
PSMC1BLNK_P1FEBM1_POSITION               equ 0005h
PSMC1BLNK_P1FEBM1_SIZE                   equ 0001h
PSMC1BLNK_P1FEBM1_LENGTH                 equ 0001h
PSMC1BLNK_P1FEBM1_MASK                   equ 0020h

// Register: PSMC1REBS
#define PSMC1REBS PSMC1REBS
PSMC1REBS                                equ 0818h
// bitfield definitions
PSMC1REBS_P1REBSC1_POSN                  equ 0001h
PSMC1REBS_P1REBSC1_POSITION              equ 0001h
PSMC1REBS_P1REBSC1_SIZE                  equ 0001h
PSMC1REBS_P1REBSC1_LENGTH                equ 0001h
PSMC1REBS_P1REBSC1_MASK                  equ 0002h
PSMC1REBS_P1REBSC2_POSN                  equ 0002h
PSMC1REBS_P1REBSC2_POSITION              equ 0002h
PSMC1REBS_P1REBSC2_SIZE                  equ 0001h
PSMC1REBS_P1REBSC2_LENGTH                equ 0001h
PSMC1REBS_P1REBSC2_MASK                  equ 0004h
PSMC1REBS_P1REBSC3_POSN                  equ 0003h
PSMC1REBS_P1REBSC3_POSITION              equ 0003h
PSMC1REBS_P1REBSC3_SIZE                  equ 0001h
PSMC1REBS_P1REBSC3_LENGTH                equ 0001h
PSMC1REBS_P1REBSC3_MASK                  equ 0008h
PSMC1REBS_P1REBSC4_POSN                  equ 0004h
PSMC1REBS_P1REBSC4_POSITION              equ 0004h
PSMC1REBS_P1REBSC4_SIZE                  equ 0001h
PSMC1REBS_P1REBSC4_LENGTH                equ 0001h
PSMC1REBS_P1REBSC4_MASK                  equ 0010h
PSMC1REBS_P1REBSIN_POSN                  equ 0007h
PSMC1REBS_P1REBSIN_POSITION              equ 0007h
PSMC1REBS_P1REBSIN_SIZE                  equ 0001h
PSMC1REBS_P1REBSIN_LENGTH                equ 0001h
PSMC1REBS_P1REBSIN_MASK                  equ 0080h

// Register: PSMC1FEBS
#define PSMC1FEBS PSMC1FEBS
PSMC1FEBS                                equ 0819h
// bitfield definitions
PSMC1FEBS_P1FEBSC1_POSN                  equ 0001h
PSMC1FEBS_P1FEBSC1_POSITION              equ 0001h
PSMC1FEBS_P1FEBSC1_SIZE                  equ 0001h
PSMC1FEBS_P1FEBSC1_LENGTH                equ 0001h
PSMC1FEBS_P1FEBSC1_MASK                  equ 0002h
PSMC1FEBS_P1FEBSC2_POSN                  equ 0002h
PSMC1FEBS_P1FEBSC2_POSITION              equ 0002h
PSMC1FEBS_P1FEBSC2_SIZE                  equ 0001h
PSMC1FEBS_P1FEBSC2_LENGTH                equ 0001h
PSMC1FEBS_P1FEBSC2_MASK                  equ 0004h
PSMC1FEBS_P1FEBSC3_POSN                  equ 0003h
PSMC1FEBS_P1FEBSC3_POSITION              equ 0003h
PSMC1FEBS_P1FEBSC3_SIZE                  equ 0001h
PSMC1FEBS_P1FEBSC3_LENGTH                equ 0001h
PSMC1FEBS_P1FEBSC3_MASK                  equ 0008h
PSMC1FEBS_P1FEBSC4_POSN                  equ 0004h
PSMC1FEBS_P1FEBSC4_POSITION              equ 0004h
PSMC1FEBS_P1FEBSC4_SIZE                  equ 0001h
PSMC1FEBS_P1FEBSC4_LENGTH                equ 0001h
PSMC1FEBS_P1FEBSC4_MASK                  equ 0010h
PSMC1FEBS_P1FEBSIN_POSN                  equ 0007h
PSMC1FEBS_P1FEBSIN_POSITION              equ 0007h
PSMC1FEBS_P1FEBSIN_SIZE                  equ 0001h
PSMC1FEBS_P1FEBSIN_LENGTH                equ 0001h
PSMC1FEBS_P1FEBSIN_MASK                  equ 0080h

// Register: PSMC1PHS
#define PSMC1PHS PSMC1PHS
PSMC1PHS                                 equ 081Ah
// bitfield definitions
PSMC1PHS_P1PHST_POSN                     equ 0000h
PSMC1PHS_P1PHST_POSITION                 equ 0000h
PSMC1PHS_P1PHST_SIZE                     equ 0001h
PSMC1PHS_P1PHST_LENGTH                   equ 0001h
PSMC1PHS_P1PHST_MASK                     equ 0001h
PSMC1PHS_P1PHSC1_POSN                    equ 0001h
PSMC1PHS_P1PHSC1_POSITION                equ 0001h
PSMC1PHS_P1PHSC1_SIZE                    equ 0001h
PSMC1PHS_P1PHSC1_LENGTH                  equ 0001h
PSMC1PHS_P1PHSC1_MASK                    equ 0002h
PSMC1PHS_P1PHSC2_POSN                    equ 0002h
PSMC1PHS_P1PHSC2_POSITION                equ 0002h
PSMC1PHS_P1PHSC2_SIZE                    equ 0001h
PSMC1PHS_P1PHSC2_LENGTH                  equ 0001h
PSMC1PHS_P1PHSC2_MASK                    equ 0004h
PSMC1PHS_P1PHSC3_POSN                    equ 0003h
PSMC1PHS_P1PHSC3_POSITION                equ 0003h
PSMC1PHS_P1PHSC3_SIZE                    equ 0001h
PSMC1PHS_P1PHSC3_LENGTH                  equ 0001h
PSMC1PHS_P1PHSC3_MASK                    equ 0008h
PSMC1PHS_P1PHSC4_POSN                    equ 0004h
PSMC1PHS_P1PHSC4_POSITION                equ 0004h
PSMC1PHS_P1PHSC4_SIZE                    equ 0001h
PSMC1PHS_P1PHSC4_LENGTH                  equ 0001h
PSMC1PHS_P1PHSC4_MASK                    equ 0010h
PSMC1PHS_P1PHSIN_POSN                    equ 0007h
PSMC1PHS_P1PHSIN_POSITION                equ 0007h
PSMC1PHS_P1PHSIN_SIZE                    equ 0001h
PSMC1PHS_P1PHSIN_LENGTH                  equ 0001h
PSMC1PHS_P1PHSIN_MASK                    equ 0080h

// Register: PSMC1DCS
#define PSMC1DCS PSMC1DCS
PSMC1DCS                                 equ 081Bh
// bitfield definitions
PSMC1DCS_P1DCST_POSN                     equ 0000h
PSMC1DCS_P1DCST_POSITION                 equ 0000h
PSMC1DCS_P1DCST_SIZE                     equ 0001h
PSMC1DCS_P1DCST_LENGTH                   equ 0001h
PSMC1DCS_P1DCST_MASK                     equ 0001h
PSMC1DCS_P1DCSC1_POSN                    equ 0001h
PSMC1DCS_P1DCSC1_POSITION                equ 0001h
PSMC1DCS_P1DCSC1_SIZE                    equ 0001h
PSMC1DCS_P1DCSC1_LENGTH                  equ 0001h
PSMC1DCS_P1DCSC1_MASK                    equ 0002h
PSMC1DCS_P1DCSC2_POSN                    equ 0002h
PSMC1DCS_P1DCSC2_POSITION                equ 0002h
PSMC1DCS_P1DCSC2_SIZE                    equ 0001h
PSMC1DCS_P1DCSC2_LENGTH                  equ 0001h
PSMC1DCS_P1DCSC2_MASK                    equ 0004h
PSMC1DCS_P1DCSC3_POSN                    equ 0003h
PSMC1DCS_P1DCSC3_POSITION                equ 0003h
PSMC1DCS_P1DCSC3_SIZE                    equ 0001h
PSMC1DCS_P1DCSC3_LENGTH                  equ 0001h
PSMC1DCS_P1DCSC3_MASK                    equ 0008h
PSMC1DCS_P1DCSC4_POSN                    equ 0004h
PSMC1DCS_P1DCSC4_POSITION                equ 0004h
PSMC1DCS_P1DCSC4_SIZE                    equ 0001h
PSMC1DCS_P1DCSC4_LENGTH                  equ 0001h
PSMC1DCS_P1DCSC4_MASK                    equ 0010h
PSMC1DCS_P1DCSIN_POSN                    equ 0007h
PSMC1DCS_P1DCSIN_POSITION                equ 0007h
PSMC1DCS_P1DCSIN_SIZE                    equ 0001h
PSMC1DCS_P1DCSIN_LENGTH                  equ 0001h
PSMC1DCS_P1DCSIN_MASK                    equ 0080h

// Register: PSMC1PRS
#define PSMC1PRS PSMC1PRS
PSMC1PRS                                 equ 081Ch
// bitfield definitions
PSMC1PRS_P1PRST_POSN                     equ 0000h
PSMC1PRS_P1PRST_POSITION                 equ 0000h
PSMC1PRS_P1PRST_SIZE                     equ 0001h
PSMC1PRS_P1PRST_LENGTH                   equ 0001h
PSMC1PRS_P1PRST_MASK                     equ 0001h
PSMC1PRS_P1PRSC1_POSN                    equ 0001h
PSMC1PRS_P1PRSC1_POSITION                equ 0001h
PSMC1PRS_P1PRSC1_SIZE                    equ 0001h
PSMC1PRS_P1PRSC1_LENGTH                  equ 0001h
PSMC1PRS_P1PRSC1_MASK                    equ 0002h
PSMC1PRS_P1PRSC2_POSN                    equ 0002h
PSMC1PRS_P1PRSC2_POSITION                equ 0002h
PSMC1PRS_P1PRSC2_SIZE                    equ 0001h
PSMC1PRS_P1PRSC2_LENGTH                  equ 0001h
PSMC1PRS_P1PRSC2_MASK                    equ 0004h
PSMC1PRS_P1PRSC3_POSN                    equ 0003h
PSMC1PRS_P1PRSC3_POSITION                equ 0003h
PSMC1PRS_P1PRSC3_SIZE                    equ 0001h
PSMC1PRS_P1PRSC3_LENGTH                  equ 0001h
PSMC1PRS_P1PRSC3_MASK                    equ 0008h
PSMC1PRS_P1PRSC4_POSN                    equ 0004h
PSMC1PRS_P1PRSC4_POSITION                equ 0004h
PSMC1PRS_P1PRSC4_SIZE                    equ 0001h
PSMC1PRS_P1PRSC4_LENGTH                  equ 0001h
PSMC1PRS_P1PRSC4_MASK                    equ 0010h
PSMC1PRS_P1PRSIN_POSN                    equ 0007h
PSMC1PRS_P1PRSIN_POSITION                equ 0007h
PSMC1PRS_P1PRSIN_SIZE                    equ 0001h
PSMC1PRS_P1PRSIN_LENGTH                  equ 0001h
PSMC1PRS_P1PRSIN_MASK                    equ 0080h

// Register: PSMC1ASDC
#define PSMC1ASDC PSMC1ASDC
PSMC1ASDC                                equ 081Dh
// bitfield definitions
PSMC1ASDC_P1ASDOV_POSN                   equ 0000h
PSMC1ASDC_P1ASDOV_POSITION               equ 0000h
PSMC1ASDC_P1ASDOV_SIZE                   equ 0001h
PSMC1ASDC_P1ASDOV_LENGTH                 equ 0001h
PSMC1ASDC_P1ASDOV_MASK                   equ 0001h
PSMC1ASDC_P1ARSEN_POSN                   equ 0005h
PSMC1ASDC_P1ARSEN_POSITION               equ 0005h
PSMC1ASDC_P1ARSEN_SIZE                   equ 0001h
PSMC1ASDC_P1ARSEN_LENGTH                 equ 0001h
PSMC1ASDC_P1ARSEN_MASK                   equ 0020h
PSMC1ASDC_P1ASDEN_POSN                   equ 0006h
PSMC1ASDC_P1ASDEN_POSITION               equ 0006h
PSMC1ASDC_P1ASDEN_SIZE                   equ 0001h
PSMC1ASDC_P1ASDEN_LENGTH                 equ 0001h
PSMC1ASDC_P1ASDEN_MASK                   equ 0040h
PSMC1ASDC_P1ASE_POSN                     equ 0007h
PSMC1ASDC_P1ASE_POSITION                 equ 0007h
PSMC1ASDC_P1ASE_SIZE                     equ 0001h
PSMC1ASDC_P1ASE_LENGTH                   equ 0001h
PSMC1ASDC_P1ASE_MASK                     equ 0080h

// Register: PSMC1ASDL
#define PSMC1ASDL PSMC1ASDL
PSMC1ASDL                                equ 081Eh
// bitfield definitions
PSMC1ASDL_P1ASDLA_POSN                   equ 0000h
PSMC1ASDL_P1ASDLA_POSITION               equ 0000h
PSMC1ASDL_P1ASDLA_SIZE                   equ 0001h
PSMC1ASDL_P1ASDLA_LENGTH                 equ 0001h
PSMC1ASDL_P1ASDLA_MASK                   equ 0001h
PSMC1ASDL_P1ASDLB_POSN                   equ 0001h
PSMC1ASDL_P1ASDLB_POSITION               equ 0001h
PSMC1ASDL_P1ASDLB_SIZE                   equ 0001h
PSMC1ASDL_P1ASDLB_LENGTH                 equ 0001h
PSMC1ASDL_P1ASDLB_MASK                   equ 0002h
PSMC1ASDL_P1ASDLC_POSN                   equ 0002h
PSMC1ASDL_P1ASDLC_POSITION               equ 0002h
PSMC1ASDL_P1ASDLC_SIZE                   equ 0001h
PSMC1ASDL_P1ASDLC_LENGTH                 equ 0001h
PSMC1ASDL_P1ASDLC_MASK                   equ 0004h
PSMC1ASDL_P1ASDLD_POSN                   equ 0003h
PSMC1ASDL_P1ASDLD_POSITION               equ 0003h
PSMC1ASDL_P1ASDLD_SIZE                   equ 0001h
PSMC1ASDL_P1ASDLD_LENGTH                 equ 0001h
PSMC1ASDL_P1ASDLD_MASK                   equ 0008h
PSMC1ASDL_P1ASDLE_POSN                   equ 0004h
PSMC1ASDL_P1ASDLE_POSITION               equ 0004h
PSMC1ASDL_P1ASDLE_SIZE                   equ 0001h
PSMC1ASDL_P1ASDLE_LENGTH                 equ 0001h
PSMC1ASDL_P1ASDLE_MASK                   equ 0010h
PSMC1ASDL_P1ASDLF_POSN                   equ 0005h
PSMC1ASDL_P1ASDLF_POSITION               equ 0005h
PSMC1ASDL_P1ASDLF_SIZE                   equ 0001h
PSMC1ASDL_P1ASDLF_LENGTH                 equ 0001h
PSMC1ASDL_P1ASDLF_MASK                   equ 0020h

// Register: PSMC1ASDS
#define PSMC1ASDS PSMC1ASDS
PSMC1ASDS                                equ 081Fh
// bitfield definitions
PSMC1ASDS_P1ASDSC1_POSN                  equ 0001h
PSMC1ASDS_P1ASDSC1_POSITION              equ 0001h
PSMC1ASDS_P1ASDSC1_SIZE                  equ 0001h
PSMC1ASDS_P1ASDSC1_LENGTH                equ 0001h
PSMC1ASDS_P1ASDSC1_MASK                  equ 0002h
PSMC1ASDS_P1ASDSC2_POSN                  equ 0002h
PSMC1ASDS_P1ASDSC2_POSITION              equ 0002h
PSMC1ASDS_P1ASDSC2_SIZE                  equ 0001h
PSMC1ASDS_P1ASDSC2_LENGTH                equ 0001h
PSMC1ASDS_P1ASDSC2_MASK                  equ 0004h
PSMC1ASDS_P1ASDSC3_POSN                  equ 0003h
PSMC1ASDS_P1ASDSC3_POSITION              equ 0003h
PSMC1ASDS_P1ASDSC3_SIZE                  equ 0001h
PSMC1ASDS_P1ASDSC3_LENGTH                equ 0001h
PSMC1ASDS_P1ASDSC3_MASK                  equ 0008h
PSMC1ASDS_P1ASDSC4_POSN                  equ 0004h
PSMC1ASDS_P1ASDSC4_POSITION              equ 0004h
PSMC1ASDS_P1ASDSC4_SIZE                  equ 0001h
PSMC1ASDS_P1ASDSC4_LENGTH                equ 0001h
PSMC1ASDS_P1ASDSC4_MASK                  equ 0010h
PSMC1ASDS_P1ASDSIN_POSN                  equ 0007h
PSMC1ASDS_P1ASDSIN_POSITION              equ 0007h
PSMC1ASDS_P1ASDSIN_SIZE                  equ 0001h
PSMC1ASDS_P1ASDSIN_LENGTH                equ 0001h
PSMC1ASDS_P1ASDSIN_MASK                  equ 0080h

// Register: PSMC1INT
#define PSMC1INT PSMC1INT
PSMC1INT                                 equ 0820h
// bitfield definitions
PSMC1INT_P1TPRIF_POSN                    equ 0000h
PSMC1INT_P1TPRIF_POSITION                equ 0000h
PSMC1INT_P1TPRIF_SIZE                    equ 0001h
PSMC1INT_P1TPRIF_LENGTH                  equ 0001h
PSMC1INT_P1TPRIF_MASK                    equ 0001h
PSMC1INT_P1TDCIF_POSN                    equ 0001h
PSMC1INT_P1TDCIF_POSITION                equ 0001h
PSMC1INT_P1TDCIF_SIZE                    equ 0001h
PSMC1INT_P1TDCIF_LENGTH                  equ 0001h
PSMC1INT_P1TDCIF_MASK                    equ 0002h
PSMC1INT_P1TPHIF_POSN                    equ 0002h
PSMC1INT_P1TPHIF_POSITION                equ 0002h
PSMC1INT_P1TPHIF_SIZE                    equ 0001h
PSMC1INT_P1TPHIF_LENGTH                  equ 0001h
PSMC1INT_P1TPHIF_MASK                    equ 0004h
PSMC1INT_P1TOVIF_POSN                    equ 0003h
PSMC1INT_P1TOVIF_POSITION                equ 0003h
PSMC1INT_P1TOVIF_SIZE                    equ 0001h
PSMC1INT_P1TOVIF_LENGTH                  equ 0001h
PSMC1INT_P1TOVIF_MASK                    equ 0008h
PSMC1INT_P1TPRIE_POSN                    equ 0004h
PSMC1INT_P1TPRIE_POSITION                equ 0004h
PSMC1INT_P1TPRIE_SIZE                    equ 0001h
PSMC1INT_P1TPRIE_LENGTH                  equ 0001h
PSMC1INT_P1TPRIE_MASK                    equ 0010h
PSMC1INT_P1TDCIE_POSN                    equ 0005h
PSMC1INT_P1TDCIE_POSITION                equ 0005h
PSMC1INT_P1TDCIE_SIZE                    equ 0001h
PSMC1INT_P1TDCIE_LENGTH                  equ 0001h
PSMC1INT_P1TDCIE_MASK                    equ 0020h
PSMC1INT_P1TPHIE_POSN                    equ 0006h
PSMC1INT_P1TPHIE_POSITION                equ 0006h
PSMC1INT_P1TPHIE_SIZE                    equ 0001h
PSMC1INT_P1TPHIE_LENGTH                  equ 0001h
PSMC1INT_P1TPHIE_MASK                    equ 0040h
PSMC1INT_P1TOVIE_POSN                    equ 0007h
PSMC1INT_P1TOVIE_POSITION                equ 0007h
PSMC1INT_P1TOVIE_SIZE                    equ 0001h
PSMC1INT_P1TOVIE_LENGTH                  equ 0001h
PSMC1INT_P1TOVIE_MASK                    equ 0080h

// Register: PSMC1PHL
#define PSMC1PHL PSMC1PHL
PSMC1PHL                                 equ 0821h
// bitfield definitions
PSMC1PHL_PSMC1PH0_POSN                   equ 0000h
PSMC1PHL_PSMC1PH0_POSITION               equ 0000h
PSMC1PHL_PSMC1PH0_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH0_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH0_MASK                   equ 0001h
PSMC1PHL_PSMC1PH1_POSN                   equ 0001h
PSMC1PHL_PSMC1PH1_POSITION               equ 0001h
PSMC1PHL_PSMC1PH1_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH1_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH1_MASK                   equ 0002h
PSMC1PHL_PSMC1PH2_POSN                   equ 0002h
PSMC1PHL_PSMC1PH2_POSITION               equ 0002h
PSMC1PHL_PSMC1PH2_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH2_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH2_MASK                   equ 0004h
PSMC1PHL_PSMC1PH3_POSN                   equ 0003h
PSMC1PHL_PSMC1PH3_POSITION               equ 0003h
PSMC1PHL_PSMC1PH3_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH3_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH3_MASK                   equ 0008h
PSMC1PHL_PSMC1PH4_POSN                   equ 0004h
PSMC1PHL_PSMC1PH4_POSITION               equ 0004h
PSMC1PHL_PSMC1PH4_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH4_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH4_MASK                   equ 0010h
PSMC1PHL_PSMC1PH5_POSN                   equ 0005h
PSMC1PHL_PSMC1PH5_POSITION               equ 0005h
PSMC1PHL_PSMC1PH5_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH5_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH5_MASK                   equ 0020h
PSMC1PHL_PSMC1PH6_POSN                   equ 0006h
PSMC1PHL_PSMC1PH6_POSITION               equ 0006h
PSMC1PHL_PSMC1PH6_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH6_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH6_MASK                   equ 0040h
PSMC1PHL_PSMC1PH7_POSN                   equ 0007h
PSMC1PHL_PSMC1PH7_POSITION               equ 0007h
PSMC1PHL_PSMC1PH7_SIZE                   equ 0001h
PSMC1PHL_PSMC1PH7_LENGTH                 equ 0001h
PSMC1PHL_PSMC1PH7_MASK                   equ 0080h

