GopalSaraf/Practicals/PSDL/include/proc/pic16lf1787.inc
// Register: PSMC2MDL
#define PSMC2MDL PSMC2MDL
PSMC2MDL                                 equ 0832h
// bitfield definitions
PSMC2MDL_P2MSRC_POSN                     equ 0000h
PSMC2MDL_P2MSRC_POSITION                 equ 0000h
PSMC2MDL_P2MSRC_SIZE                     equ 0004h
PSMC2MDL_P2MSRC_LENGTH                   equ 0004h
PSMC2MDL_P2MSRC_MASK                     equ 000Fh
PSMC2MDL_P2MDLBIT_POSN                   equ 0005h
PSMC2MDL_P2MDLBIT_POSITION               equ 0005h
PSMC2MDL_P2MDLBIT_SIZE                   equ 0001h
PSMC2MDL_P2MDLBIT_LENGTH                 equ 0001h
PSMC2MDL_P2MDLBIT_MASK                   equ 0020h
PSMC2MDL_P2MDLPOL_POSN                   equ 0006h
PSMC2MDL_P2MDLPOL_POSITION               equ 0006h
PSMC2MDL_P2MDLPOL_SIZE                   equ 0001h
PSMC2MDL_P2MDLPOL_LENGTH                 equ 0001h
PSMC2MDL_P2MDLPOL_MASK                   equ 0040h
PSMC2MDL_P2MDLEN_POSN                    equ 0007h
PSMC2MDL_P2MDLEN_POSITION                equ 0007h
PSMC2MDL_P2MDLEN_SIZE                    equ 0001h
PSMC2MDL_P2MDLEN_LENGTH                  equ 0001h
PSMC2MDL_P2MDLEN_MASK                    equ 0080h
PSMC2MDL_P2MSRC0_POSN                    equ 0000h
PSMC2MDL_P2MSRC0_POSITION                equ 0000h
PSMC2MDL_P2MSRC0_SIZE                    equ 0001h
PSMC2MDL_P2MSRC0_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC0_MASK                    equ 0001h
PSMC2MDL_P2MSRC1_POSN                    equ 0001h
PSMC2MDL_P2MSRC1_POSITION                equ 0001h
PSMC2MDL_P2MSRC1_SIZE                    equ 0001h
PSMC2MDL_P2MSRC1_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC1_MASK                    equ 0002h
PSMC2MDL_P2MSRC2_POSN                    equ 0002h
PSMC2MDL_P2MSRC2_POSITION                equ 0002h
PSMC2MDL_P2MSRC2_SIZE                    equ 0001h
PSMC2MDL_P2MSRC2_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC2_MASK                    equ 0004h
PSMC2MDL_P2MSRC3_POSN                    equ 0003h
PSMC2MDL_P2MSRC3_POSITION                equ 0003h
PSMC2MDL_P2MSRC3_SIZE                    equ 0001h
PSMC2MDL_P2MSRC3_LENGTH                  equ 0001h
PSMC2MDL_P2MSRC3_MASK                    equ 0008h

// Register: PSMC2SYNC
#define PSMC2SYNC PSMC2SYNC
PSMC2SYNC                                equ 0833h
// bitfield definitions
PSMC2SYNC_P2SYNC0_POSN                   equ 0000h
PSMC2SYNC_P2SYNC0_POSITION               equ 0000h
PSMC2SYNC_P2SYNC0_SIZE                   equ 0001h
PSMC2SYNC_P2SYNC0_LENGTH                 equ 0001h
PSMC2SYNC_P2SYNC0_MASK                   equ 0001h
PSMC2SYNC_P2SYNC1_POSN                   equ 0001h
PSMC2SYNC_P2SYNC1_POSITION               equ 0001h
PSMC2SYNC_P2SYNC1_SIZE                   equ 0001h
PSMC2SYNC_P2SYNC1_LENGTH                 equ 0001h
PSMC2SYNC_P2SYNC1_MASK                   equ 0002h
PSMC2SYNC_P2SYNC2_POSN                   equ 0002h
PSMC2SYNC_P2SYNC2_POSITION               equ 0002h
PSMC2SYNC_P2SYNC2_SIZE                   equ 0001h
PSMC2SYNC_P2SYNC2_LENGTH                 equ 0001h
PSMC2SYNC_P2SYNC2_MASK                   equ 0004h
PSMC2SYNC_P2DCPOL_POSN                   equ 0005h
PSMC2SYNC_P2DCPOL_POSITION               equ 0005h
PSMC2SYNC_P2DCPOL_SIZE                   equ 0001h
PSMC2SYNC_P2DCPOL_LENGTH                 equ 0001h
PSMC2SYNC_P2DCPOL_MASK                   equ 0020h
PSMC2SYNC_P2PRPOL_POSN                   equ 0006h
PSMC2SYNC_P2PRPOL_POSITION               equ 0006h
PSMC2SYNC_P2PRPOL_SIZE                   equ 0001h
PSMC2SYNC_P2PRPOL_LENGTH                 equ 0001h
PSMC2SYNC_P2PRPOL_MASK                   equ 0040h
PSMC2SYNC_P2POFST_POSN                   equ 0007h
PSMC2SYNC_P2POFST_POSITION               equ 0007h
PSMC2SYNC_P2POFST_SIZE                   equ 0001h
PSMC2SYNC_P2POFST_LENGTH                 equ 0001h
PSMC2SYNC_P2POFST_MASK                   equ 0080h

// Register: PSMC2CLK
#define PSMC2CLK PSMC2CLK
PSMC2CLK                                 equ 0834h
// bitfield definitions
PSMC2CLK_P2CSRC0_POSN                    equ 0000h
PSMC2CLK_P2CSRC0_POSITION                equ 0000h
PSMC2CLK_P2CSRC0_SIZE                    equ 0001h
PSMC2CLK_P2CSRC0_LENGTH                  equ 0001h
PSMC2CLK_P2CSRC0_MASK                    equ 0001h
PSMC2CLK_P2CSRC1_POSN                    equ 0001h
PSMC2CLK_P2CSRC1_POSITION                equ 0001h
PSMC2CLK_P2CSRC1_SIZE                    equ 0001h
PSMC2CLK_P2CSRC1_LENGTH                  equ 0001h
PSMC2CLK_P2CSRC1_MASK                    equ 0002h
PSMC2CLK_P2CPRE0_POSN                    equ 0004h
PSMC2CLK_P2CPRE0_POSITION                equ 0004h
PSMC2CLK_P2CPRE0_SIZE                    equ 0001h
PSMC2CLK_P2CPRE0_LENGTH                  equ 0001h
PSMC2CLK_P2CPRE0_MASK                    equ 0010h
PSMC2CLK_P2CPRE1_POSN                    equ 0005h
PSMC2CLK_P2CPRE1_POSITION                equ 0005h
PSMC2CLK_P2CPRE1_SIZE                    equ 0001h
PSMC2CLK_P2CPRE1_LENGTH                  equ 0001h
PSMC2CLK_P2CPRE1_MASK                    equ 0020h
PSMC2CLK_P2CSRC_POSN                     equ 0000h
PSMC2CLK_P2CSRC_POSITION                 equ 0000h
PSMC2CLK_P2CSRC_SIZE                     equ 0002h
PSMC2CLK_P2CSRC_LENGTH                   equ 0002h
PSMC2CLK_P2CSRC_MASK                     equ 0003h
PSMC2CLK_P2CPRE_POSN                     equ 0004h
PSMC2CLK_P2CPRE_POSITION                 equ 0004h
PSMC2CLK_P2CPRE_SIZE                     equ 0002h
PSMC2CLK_P2CPRE_LENGTH                   equ 0002h
PSMC2CLK_P2CPRE_MASK                     equ 0030h

// Register: PSMC2OEN
#define PSMC2OEN PSMC2OEN
PSMC2OEN                                 equ 0835h
// bitfield definitions
PSMC2OEN_P2OEA_POSN                      equ 0000h
PSMC2OEN_P2OEA_POSITION                  equ 0000h
PSMC2OEN_P2OEA_SIZE                      equ 0001h
PSMC2OEN_P2OEA_LENGTH                    equ 0001h
PSMC2OEN_P2OEA_MASK                      equ 0001h
PSMC2OEN_P2OEB_POSN                      equ 0001h
PSMC2OEN_P2OEB_POSITION                  equ 0001h
PSMC2OEN_P2OEB_SIZE                      equ 0001h
PSMC2OEN_P2OEB_LENGTH                    equ 0001h
PSMC2OEN_P2OEB_MASK                      equ 0002h

